---
kind: method
id: M:Autodesk.Revit.DB.PaperSizeSet.Erase(Autodesk.Revit.DB.PaperSize)
source: html/749109b5-7e34-2b57-0109-d115b6ecd3f9.htm
---
# Autodesk.Revit.DB.PaperSizeSet.Erase Method

Removes a specified object from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	PaperSize item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.PaperSize`) - The item to be erased.

## Returns
The number of items that were erased from the set.